In [42]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import exc

In [3]:
HOST = "localhost"
USER = "root"
PASSWORD = "RumahMakan02"
DB = "sakila"

Create Connection to DB in MYSQL

In [22]:
conn = create_engine(f'mysql://{USER}:{PASSWORD}@{HOST}/{DB}')
conn

Engine(mysql://root:***@localhost/sakila)

Test Connection, Load all Tables in Sakila DB

In [7]:
conn.execute("SHOW TABLES").fetchall()

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

Get Customer DIM: from table customer, address, city, country

In [8]:
query_cust = """select 
                    c.customer_id,
                    CONCAT(c.first_name, " ", c.last_name) full_name,
                    IF(c.active=1, "Yes", "No") is_active,
                    IFNULL(a.address, a.address2) address,
                    a.district,
                    ci.city,
                    co.country,
                    c.create_date valid_from
                FROM customer c
                    JOIN address a
                        USING(address_id)
                    JOIN city as ci
                        USING(city_id)
                    JOIN country as co
                        USING(country_id);"""

In [14]:
dim_customer = pd.DataFrame(conn.execute(query_cust).fetchall())
dim_customer

,customer_id,full_name,is_active,address,district,city,country,valid_from
0,218,VERA MCCOY,Yes,1168 Najafabad Parkway,Kabol,Kabul,Afghanistan,2006-02-14 22:04:36
1,441,MARIO CHEATHAM,Yes,1924 Shimonoseki Drive,Batna,Batna,Algeria,2006-02-14 22:04:37
2,69,JUDY GRAY,Yes,1031 Daugavpils Parkway,Béchar,Béchar,Algeria,2006-02-14 22:04:36
3,176,JUNE CARROLL,Yes,757 Rustenburg Avenue,Skikda,Skikda,Algeria,2006-02-14 22:04:36
4,320,ANTHONY SCHWAB,Yes,1892 Nabereznyje Telny Lane,Tutuila,Tafuna,American Samoa,2006-02-14 22:04:37
...,...,...,...,...,...,...,...,...
594,303,WILLIAM SATTERFIELD,Yes,687 Alessandria Parkway,Sanaa,Sanaa,Yemen,2006-02-14 22:04:37
595,213,GINA WILLIAMSON,Yes,1001 Miyakonojo Lane,Taizz,Taizz,Yemen,2006-02-14 22:04:36
596,7,MARIA MILLER,Yes,900 Santiago de Compostela Parkway,Central Serbia,Kragujevac,Yugoslavia,2006-02-14 22:04:36
597,553,MAX PITT,Yes,1917 Kumbakonam Parkway,Vojvodina,Novi Sad,Yugoslavia,2006-02-14 22:04:37
598,438,BARRY LOVELACE,Yes,1836 Korla Parkway,Copperbelt,Kitwe,Zambia,2006-02-14 22:04:37

DIM STORE : store, staff, address, city, country

In [16]:
query_store = """
                select 
                    s.store_id, 
                    a.address store_address, 
                    a.district store_district, 
                    ci.city store_city, 
                    co.country store_country,
                    s.manager_staff_id store_manager_id,
                    CONCAT(st.first_name, " ", st.last_name) store_manager_name
                FROM store s
                    JOIN address a
                        USING(address_id)
                    JOIN city as ci
                        USING(city_id)
                    JOIN country as co
                        USING(country_id)
                    JOIN staff st
                        ON s.manager_staff_id = st.staff_id;
                """

In [17]:
dim_store = pd.DataFrame(conn.execute(query_store).fetchall())
dim_store

,store_id,store_address,store_district,store_city,store_country,store_manager_id,store_manager_name
0,1,47 MySakila Drive,Alberta,Lethbridge,Canada,1,Mike Hillyer
1,2,28 MySQL Boulevard,QLD,Woodridge,Australia,2,Jon Stephens

DIM Staff : staff, store

In [24]:
query_staff = """
                SELECT 
                    st.staff_id, 
                    CONCAT(st.first_name, " ", st.last_name) staff_name,
                    s.store_id staff_store_id,
                    IF(st.active=1, "Yes", "No") is_active
                from staff st
                    JOIN store s
                        ON s.manager_staff_id = st.staff_id;
              """

In [25]:
dim_staff = pd.DataFrame(conn.execute(query_staff).fetchall())
dim_staff

   staff_id    staff_name  staff_store_id is_active
0         1  Mike Hillyer               1       Yes
1         2  Jon Stephens               2       Yes

DIM FILM: film, language, film_category, category

In [26]:
query_film = """
            SELECT 
                f.title, 
                f.description, 
                f.release_year,
                l.name language,
                f.rental_duration,
                f.rental_rate,
                f.length duration,
                f.replacement_cost,
                f.rating,
                c.name category
            FROM film f
                JOIN language l
                    USING(language_id)
                JOIN film_category fc
                    USING(film_id)
                JOIN category c
                    USING(category_id)
                """

In [27]:
dim_film = pd.DataFrame(conn.execute(query_film).fetchall())
dim_film

,title,description,release_year,language,rental_duration,rental_rate,duration,replacement_cost,rating,category
0,AMADEUS HOLY,A Emotional Display of a Pioneer And a Technic...,2006,English,6,0.99,113,20.99,PG,Action
1,AMERICAN CIRCUS,A Insightful Drama of a Girl And a Astronaut w...,2006,English,3,4.99,129,17.99,R,Action
2,ANTITRUST TOMATOES,A Fateful Yarn of a Womanizer And a Feminist w...,2006,English,5,2.99,168,11.99,NC-17,Action
3,ARK RIDGEMONT,A Beautiful Yarn of a Pioneer And a Monkey who...,2006,English,6,0.99,68,25.99,NC-17,Action
4,BAREFOOT MANCHURIAN,A Intrepid Story of a Cat And a Student who mu...,2006,English,6,2.99,129,15.99,G,Action
...,...,...,...,...,...,...,...,...,...,...
995,VALENTINE VANISHING,A Thrilling Display of a Husband And a Butler ...,2006,English,7,0.99,48,9.99,PG-13,Travel
996,WINDOW SIDE,A Astounding Character Study of a Womanizer An...,2006,English,3,2.99,85,25.99,R,Travel
997,WOLVES DESIRE,A Fast-Paced Drama of a Squirrel And a Robot w...,2006,English,7,0.99,55,13.99,NC-17,Travel
998,WORKER TARZAN,A Action-Packed Yarn of a Secret Agent And a T...,2006,English,7,2.99,139,26.99,R,Travel
999,WORKING MICROCOSMOS,A Stunning Epistle of a Dentist And a Dog who ...,2006,English,4,4.99,74,22.99,R,Travel

Fact rental : rental, payment, inventory,

In [52]:
query_rental = """
                SELECT 
                    r.customer_id,
                    r.staff_id,
                    i.store_id,
                    i.film_id,
                    r.rental_date,
                    DATEDIFF(r.return_date, r.rental_date) rent_duration,
                    p.amount
                FROM rental r
                    JOIN inventory i
                        USING(inventory_id)
                    JOIN payment p
                        USING(rental_id)
                """

In [29]:
fact_rental = pd.DataFrame(conn.execute(query_rental).fetchall())
fact_rental

,customer_id,staff_id,store_id,film_id,rental_date,rent_duration,amount
0,431,2,1,1,2005-07-08 19:03:15,3.0,0.99
1,518,1,1,1,2005-08-02 20:13:10,9.0,3.99
2,279,1,1,1,2005-08-21 21:27:43,9.0,3.99
3,411,1,1,1,2005-05-30 20:21:07,7.0,1.99
4,170,2,1,1,2005-06-17 20:24:00,6.0,0.99
...,...,...,...,...,...,...,...
16039,215,2,2,1000,2005-05-29 03:49:03,2.0,4.99
16040,235,2,2,1000,2005-06-15 21:50:32,2.0,4.99
16041,226,2,2,1000,2005-07-12 13:24:47,8.0,9.99
16042,401,2,2,1000,2005-07-31 07:32:21,1.0,4.99
16043,541,2,2,1000,2005-08-19 03:49:28,6.0,7.99

Functional

In [32]:
def create_db_connection(host_name, user_name, user_password, db_name):
    conn = None
    try:
        conn = create_engine(f'mysql://{user_name}:{user_password}@{host_name}/{db_name}')
        print("MySQL database connection successfull")
    except Error as err:
        print(f"Error: {err}")
    return conn

In [35]:
con = create_db_connection(HOST, USER, PASSWORD, DB)

MySQL database connection successfull

In [53]:
def read_query(conn, query):
    result = None
    try:
        fetch_data = conn.execute(query).fetchall()
        result = pd.DataFrame(fetch_data)
        return result
    except exc.SQLAlchemyError as err:
        print(f"Error: {err}")

In [54]:
read_query(con, query_rental)

,customer_id,staff_id,store_id,film_id,rental_date,rent_duration,amount
0,431,2,1,1,2005-07-08 19:03:15,3.0,0.99
1,518,1,1,1,2005-08-02 20:13:10,9.0,3.99
2,279,1,1,1,2005-08-21 21:27:43,9.0,3.99
3,411,1,1,1,2005-05-30 20:21:07,7.0,1.99
4,170,2,1,1,2005-06-17 20:24:00,6.0,0.99
...,...,...,...,...,...,...,...
16039,215,2,2,1000,2005-05-29 03:49:03,2.0,4.99
16040,235,2,2,1000,2005-06-15 21:50:32,2.0,4.99
16041,226,2,2,1000,2005-07-12 13:24:47,8.0,9.99
16042,401,2,2,1000,2005-07-31 07:32:21,1.0,4.99
16043,541,2,2,1000,2005-08-19 03:49:28,6.0,7.99

Save the Data

In [69]:
def save_tocsv(df, filename, stage=None):
    
    if stage=="extract":
        if not df.empty:
            df.to_csv(f"log_data/{filename}_{stage}.csv", index=False)
            print("data telah disimpan")
        else:
            print("Cek kembali isi dataframenya")

In [70]:
filename = "fact_rental_load"
save_tocsv(fact_rental, filename)

data telah disimpan

In [61]:
fact_rental

,customer_id,staff_id,store_id,film_id,rental_date,rent_duration,amount
0,431,2,1,1,2005-07-08 19:03:15,3.0,0.99
1,518,1,1,1,2005-08-02 20:13:10,9.0,3.99
2,279,1,1,1,2005-08-21 21:27:43,9.0,3.99
3,411,1,1,1,2005-05-30 20:21:07,7.0,1.99
4,170,2,1,1,2005-06-17 20:24:00,6.0,0.99
...,...,...,...,...,...,...,...
16039,215,2,2,1000,2005-05-29 03:49:03,2.0,4.99
16040,235,2,2,1000,2005-06-15 21:50:32,2.0,4.99
16041,226,2,2,1000,2005-07-12 13:24:47,8.0,9.99
16042,401,2,2,1000,2005-07-31 07:32:21,1.0,4.99
16043,541,2,2,1000,2005-08-19 03:49:28,6.0,7.99